{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020-2021, 2021-22)",
        "Minor in Finance"
      ],
      "degree": "Bachelor of Sciences (Honors)",
      "department": "Computer Science",
      "duration": "2018-2022",
      "school_name": "Ryerson University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_OmarSyed",
  "highlighted_projects": [
    {
      "description": "Implemented association analysis using Python to a dataset, provided as a CSV file, of customer transaction histories to use machine learning for relational discovery in the dataset. Association analysis distinguished strong rules present and followed within the transaction history to be used by the sales team for optimized marketing.",
      "git_url": "https://github.com/glitched98?tab=repositories",
      "name": "Data Mining Association Analysis"
    },
    {
      "description": "Analyzed and processed a breast cancer tumor dataset, using Python scripts, holding over 17000 data points with 569 tumor sample specifications. Implemented 5 different classification methods, Gaussian Naive Bayes Classification, SVM (Support Vector Machine), KNN (K-Nearest Neighbor Algorithm), Decision Tree Classification, and ANN (Artificial Neural Network), by using the Scikit-Learn to render a model that can predict with high accuracy whether a breast cancer tumor is benign or malignant. Accuracy was measured with a portion of the dataset being used for testing to compare the performance of the classification methods.",
      "git_url": "https://github.com/glitched98/Machine-Learning-for-a-Breast-Cancer-Dataset",
      "name": "Machine Learning"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an application to collect and send real-time resource usage data as well as hardware specifications on the Linux host to a PostgreSQL Database. The application system is built on Linux using bash scripts and PostgreSQL, while docker is used to manage the container the application runs on and the database. Crontab is used to automate the collection of real-time usage data. ",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": "Analyzed a company’s customer transaction histories to gain insight into customer behavior for better marketing strategies. Set up a data warehouse using PostgreSQL on the Jarvis Docker Container and populated it using the provided CSV file of customer transaction histories. Implemented Python Scripts using the Pandas and NumPy libraries for performing data analytics. Analyzed customer behavior and noted points of improvement for the marketing team. Recorded and documented the Python script using Jupyter Notebook. ",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "Processed data using big data tools such as Apache Hadoop to evaluate core Hadoop components such as HDFS, YARN, and MapReduce. Hadoop clustering was provisioned using Google Cloud with the use of 1 master node and 2 worker nodes. Data were queried to answer business questions using Apache Hive and Zeppelin Notebook.",
      "git_url": "/hadoop",
      "name": "Hadoop"
    }
  ],
  "name": "Omar Syed",
  "others": [
    {
      "bullets": [
        "[Certification] Azure Data Science (In-Process)",
        "[Volunteer] SRCC(Syrian Refugee Camp Charity)(2015-Present)"
      ],
      "title": "Certification"
    },
    {
      "bullets": [
        "[Sports] Volleyball, Cricket",
        "[Hobbies] Casual Gaming, Hiking, Board Games and eating out"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Developed applications and managed Data using PostgreSQL, Python(Pandas, NumPy), Hadoop, Hive, MapReduce, and Bash scripting. Implemented and used software tools such as Google Cloud Platform, VNC(Virtual Network Computing), Docker, Jupyter Notebook, and Zeppelin to complete the assigned Data Engineering projects. The position provided me with first-hand experience using the Agile/Scrum framework in an evolving work environment to host and run daily scrum meetings as well as bi-weekly sprint retrospectives.",
      "duration": "2022-Present",
      "title": "Data Engineer"
    },
    {
      "company": "SRCC",
      "description": "Managed Finances for the charity and projected optimal fundraising opportunities. Analyzed and calculated charity financial trends using MS Excel and developed plans for maximum attainable growth.",
      "duration": "2015-Present",
      "title": "Financial Treasurer"
    }
  ],
  "skills": {
    "competent": [
      "Hadoop/Hive",
      "MATLAB",
      "HTML/CSS",
      "Visual Studio",
      "Docker",
      "Oracle SQL",
      "JavaScript",
      "C++",
      "Jupyter Notebook"
    ],
    "familiar": [
      "ZenHub",
      "Zeppelin",
      "PHP",
      "YAML",
      "Tableau",
      "Google Cloud"
    ],
    "proficient": [
      "Python/Pandas/NumPy/Scikit-Learn",
      "Java",
      "Spyder",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "MS Excel"
    ]
  },
  "summary": "I graduated from Ryerson University with a Bachelor of Science (Honors) degree in Computer Science and a minor in Finance. During this time, I gathered project experience with a large variety of software tools and programming languages such as Python, Java, PHP, C/C++, HTML/CSS, JavaScript, SQL, Prolog, MATLAB, and much more. In university, I specialized in Data Engineering with courses such as Data Structures, Algorithms, Database Systems, Probability and Statistics and Data Mining. With a vast amount of experience in group projects, I learned how to effectively collaborate and efficiently lead my team to desired goals. I joined Jarvis Consulting in July of 2022, where I worked on projects revolving around key concepts such as Computer Networks, Dockers and containers, Linux bash scripting, PostgreSQL, DDL, Python Data Analytics, Pandas/Numpy, Data Warehouse, Hadoop, and more. Along with extensive technical experience, Jarvis also provided me with experience working under an Agile framework. The software and data industries excite me most for one simple reason, the extent of their reach and effect on our real and virtual world."
}
